Catalogs/КонтроллерыNET.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>КонтроллерыNET</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.IPУстройства</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скетч</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скетчи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IPУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IPУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтроллерыNET/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	//Првоерим уникальность IP адреса если он заполнен
	
	Если ЗначениеЗаполнено(АдресПорт) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтроллерыNET.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.КонтроллерыNET КАК КонтроллерыNET
		               |ГДЕ
		               |	КонтроллерыNET.АдресПорт = &АдресПорт
		               |	И КонтроллерыNET.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("АдресПорт", АдресПорт);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;	
			Сообщить("Значение АдресПорт не уникально");
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.IPУстройства") Тогда
		// Заполнение шапки
		АдресПорт = ДанныеЗаполнения.IPАдрес;
		Наименование = ДанныеЗаполнения.Наименование;
		IPУстройство = ДанныеЗаполнения.Ссылка;
		Описание = ДанныеЗаполнения.Описание; 
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
